import React from 'react';
import './FirstPage.css';

export const FirstPage = () => {
  return (
    <div className='first'>
      <img src='ganesh banner.png' alt="" />
      <div className="img-vdo">
      <iframe width="560" height="315" src="https://www.youtube.com/embed/KPwBnbdsDFE?si=OG2W4jNtA0Hnh1Jh" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share" referrerpolicy="strict-origin-when-cross-origin" allowfullscreen></iframe>
      </div>
      <div className="detailof">
        <div className="page-detail">
          <p>गणपति की सेवा मंगल मेवा, सेवा से सब विघ्न टरैं।<br />तीन लोक के सकल देवता, द्वार खड़े नित अर्ज करैं॥ <br />गणपति की सेवा मंगल मेवा…।</p>
          <p>रिद्धि-सिद्धि दक्षिण वाम विराजें, अरु आनन्द सों चमर करैं।<br /> धूप-दीप अरू लिए आरती भक्त खड़े जयकार करैं॥<br /> गणपति की सेवा मंगल मेवा…।</p>
          <p>गुड़ के मोदक भोग लगत हैं मूषक वाहन चढ्या सरैं।<br /> सौम्य रूप को देख गणपति के विघ्न भाग जा दूर परैं॥<br /> गणपति की सेवा मंगल मेवा…।</p>
          <p>भादो मास अरु शुक्ल चतुर्थी दिन दोपारा दूर परैं।<br /> लियो जन्म गणपति प्रभु जी दुर्गा मन आनन्द भरैं॥<br /> गणपति की सेवा मंगल मेवा…।</p>
          <p>अद्भुत बाजा बजा इन्द्र का देव बंधु सब गान करैं।<br /> श्री शंकर के आनन्द उपज्या नाम सुन्यो सब विघ्न टरैं॥<br /> गणपति की सेवा मंगल मेवा…।</p>
          <p>आनि विधाता बैठे आसन, इन्द्र अप्सरा नृत्य करैं।<br /> देख वेद ब्रह्मा जी जाको विघ्न विनाशक नाम धरैं॥<br /> गणपति की सेवा मंगल मेवा…।</p>
          <p>एकदन्त गजवदन विनायक त्रिनयन रूप अनूप धरैं।<br /> पगथंभा सा उदर पुष्ट है देव चन्द्रमा हास्य करैं॥<br /> गणपति की सेवा मंगल मेवा…।</p>
          <p>दे शराप श्री चन्द्रदेव को कलाहीन तत्काल करैं।<br /> चौदह लोक में फिरें गणपति तीन लोक में राज्य करैं॥<br /> गणपति की सेवा मंगल मेवा…।</p>
          <p>उठि प्रभात जप करैं ध्यान कोई ताके कारज सर्व सरैं।<br /> पूजा काल आरती गावैं ताके शिर यश छत्र फिरैं॥<br /> गणपति की सेवा मंगल मेवा…।</p>
          <p>गणपति की पूजा पहले करने से काम सभी निर्विघ्न सरैं।<br /> सभी भक्त गणपति जी के हाथ जोड़कर स्तुति करैं॥<br /> गणपति की सेवा मंगल मेवा…।</p>
        </div>
        </div>
    </div>
  )
}

export default FirstPage;